In [1]:
import pandas as pd
from scipy.stats import chi2_contingency

In [2]:
df = pd.read_csv("실기 Python 실습파일 (2)/financial_info_10k_persons.csv")
df.head(2)

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt
0,1,0,41,F,2,High School,Married,Less than $40K,Blue,36,6,2,2,4953.0,4183,67
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65

In [4]:
chi2_contingency(pd.crosstab(df["Gender"], df["Marital_status"]))

(4.093468963560284,
 0.2515464475739655,
 3,
 array([[ 392.8524, 2462.9028, 2067.3924,  392.8524],
        [ 346.1476, 2170.0972, 1821.6076,  346.1476]]))

In [5]:
# 다 입력을 해줘야 하나씩 출력할 수 있다. 
stat,p,dof,e_val = chi2_contingency(pd.crosstab(df["Gender"], df["Marital_status"]))
print(stat)
print(p)

4.093468963560284
0.2515464475739655

Q1

In [6]:
df = pd.read_csv("실기 Python 실습파일 (2)/financial_info_10k_persons.csv")
df.head(2)

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt
0,1,0,41,F,2,High School,Married,Less than $40K,Blue,36,6,2,2,4953.0,4183,67
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65

In [8]:
df_sub = df.loc[df["Edu_level"]== "High School",]                
chi2_contingency(pd.crosstab(df_sub["Gender"], 
                             df_sub["Marital_status"]),
                 correction=False)

(2.245468474581915,
 0.5230481119700401,
 3,
 array([[ 64.2641129 , 484.29435484, 393.81048387,  77.63104839],
        [ 60.7358871 , 457.70564516, 372.18951613,  73.36895161]]))

Q2.

In [16]:
df = pd.read_csv("실기 Python 실습파일 (2)/financial_info_10k_persons.csv")
df.head(2)

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt
0,1,0,41,F,2,High School,Married,Less than $40K,Blue,36,6,2,2,4953.0,4183,67
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65

In [18]:
chi2_contingency(pd.crosstab(df["Gender"], df["Card"]))

(66.45702170623164,
 2.4470625495771945e-14,
 3,
 array([[4962.486 ,   59.0076,   10.632 ,  283.8744],
        [4372.514 ,   51.9924,    9.368 ,  250.1256]]))

Q3.

In [22]:
df = pd.read_csv("실기 Python 실습파일 (2)/financial_info_10k_persons.csv")
df.head(2)

,ID,is_attrited,Age,Gender,Dependent_cnt,Edu_level,Marital_status,Income,Card,Period_m,Total_rel_cnt,Inactive_last_12m,Contacts_cnt_last_12m,Credit_limit,Total_trans_amt,Total_trans_cnt
0,1,0,41,F,2,High School,Married,Less than $40K,Blue,36,6,2,2,4953.0,4183,67
1,2,0,38,M,0,High School,Single,$80K - $120K,Blue,29,3,3,2,5983.0,4141,65

In [24]:
df["is_inactive_last_12m"] = (df["Inactive_last_12m"]>=3)+0

In [25]:
chi2_contingency(pd.crosstab(df["Inactive_last_12m"], 
                             df["is_attrited"]))

(392.26058849678714,
 1.2887936694268352e-81,
 6,
 array([[  24.3948,    4.6052],
        [1854.0048,  349.9952],
        [2728.0116,  514.9884],
        [3189.8304,  602.1696],
        [ 365.0808,   68.9192],
        [ 148.0512,   27.9488],
        [ 102.6264,   19.3736]]))